//    ~	Побитовый унарный оператор NOT
//&	Побитовый AND
//&=	Побитовый AND с присваиванием
//|	Побитовый OR
//|=	Побитовый OR с присваиванием
//^	Побитовый исключающее OR
//^=	Побитовый исключающее OR с присваиванием
//>>	Сдвиг вправо
//>>=	Сдвиг вправо с присваиванием
//>>>	Сдвиг вправо с заполнением нулями
//<<	Сдвиг влево
//<<=	Сдвиг влево с присваиванием
//>>>=	Сдвиг вправо с заполнением нулями с присваиванием
package Interview;
public class BitwiseOperation {
    static int i =8;
    public static void main(String[] args) {
        System.out.println(i);
    }

}

